# Конфигурация бота
TOKEN = "8593186262:AAGN6sTyBa1RlJ0eVWwNVzgYUb6aVy_H9LA"
ADMIN_ID = 8493522297

# Настройки валют
MSG_REWARD = 5  # Награда за сообщение
MSG_COOLDOWN = 20  # Секунд между наградами
CLAN_CREATE_COST = 1000  # Стоимость создания клана
CLAN_REWARD = 50  # Награда за 2 часа в клане
CLAN_REWARD_INTERVAL = 7200  # 2 часа в секундах

# Курсы обмена звезд на PAK
STARS_TO_PAK = {
    10: 100,    # 10 звезд = 100 PAK
    50: 500,    # 50 звезд = 500 PAK
    100: 1200,  # 100 звезд = 1200 PAK (+бонус)
    500: 6500   # 500 звезд = 6500 PAK (+бонус)
}

# Курс обмена звезд на РУБ
STARS_TO_RUB = {
    1: 1,       # 1 звезда = 1 РУБ
    10: 10,     # 10 звезд = 10 РУБ
    50: 55,     # 50 звезд = 55 РУБ (+бонус)
    100: 115    # 100 звезд = 115 РУБ (+бонус)
}
